#!/usr/bin/bash

# নিকনেম ইনপুট নেওয়া
cp banner.sh $HOME
bash banner.sh
bash info.sh
read -p $'\033[1m\033[32m   Your \033[0mNick \033[38;5;209mName \033[31m  : \033[33m\033[1m ' names

# টার্মিনাল কাস্টমাইজেশন
cd
cd ..
cd usr/etc
rm -f motd
rm -f bash.bashrc

cat <<CUSTOM>bash.bashrc
trap '' 2

# কাস্টম প্রম্পট সেটআপ
PS1='\033[1m\[\e[32m\]\033[1m┌─[\[\e[37m\]\T\[\e[32m\]\033[1m]─────\033[1m\e[1;98m\[[\033[1m\033[37m$names\033[32m]\033[1m\e[0;32m\033[1m───[\033[38;5;209m\#\033[32m]\n|\n\033[1m\e[0;32m\033[1m└─[\[\e[32m\]\e[1;33m\W\[\e[1m\033[32m]\033[1m────►\e[1;93m\033[1m '

# কাস্টম বানার
bash banner.sh
echo -e "\033[1m\033[33m

██╗  ██╗ █████╗  ██████╗██╗  ██╗███████╗██████╗
██║  ██║██╔══██╗██╔════╝██║ ██╔╝██╔════╝██╔══██╗
███████║███████║██║     █████╔╝ █████╗  ██████╔╝
██╔══██║██╔══██║██║     ██╔═██╗ ██╔══╝  ██╔══██╗
██║  ██║██║  ██║╚██████╗██║  ██╗███████╗██║  ██║
╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝
"
echo -e  "     \e[1m\e[32m▂▃▄▅▆▇▓▒░ \033[1mCoded By \e[33mCYBER GHOST \e[1m\e[32m░▒▓▇▆▅▄▃▂"
echo -e "     \033[1m\033[33m]\033[31m─────────────────────────────────────\033[33m["
echo
trap 2
CUSTOM

# টার্মিনাল বন্ধ করে দেয়
echo -e "\033[1m\e[1;32m     Your Termux is \033[33mReady \n"
sleep 2
exit
